import UIKit

//Задача 1. решение квадратного уравнения: x^2 − 8x + 12 = 0
/*var a = 1;
var b = -8;
var c = 12;
var x1: Any? = nil;
var x2: Any? = nil;

var D = ((b * b) - (4 * a * c));
print ("Дискриминант:", D);

if D > 0 {
    x1 = (((-b) - (D / 2)) / (2 * a));
    x2 = (((-b) + (D / 2)) / (2 * a));
    print ("Значение x1 =", x1,", Значение x2 =", x2);
}
else if D == 0 {
    x1 = (((-b) + (D / 2)) / (2 * a));
    print ("Значение x1 =", x1);
}
else if D < 0 {
    print ("Дискриминант отрицательный.");
}*/


//Задача 2. Даны катеты прямоугольного треугольника. Найти площадь, периметр и гипотенузу треугольника.
var a = 10;
var b = 12;

var S = (a * b)/2;
var c = sqrt((Double)(a * a) + (Double)(b * b));
var p = a + b + Int(c);
print ("Площадь треугольника равна ", S);
print ("Длина гипотенузы равна ", c);
print ("Периметр треугольника равен ", p);

